Revit 2027 API
ParameterTypeId.ModelGraphicsStyle Property
 "Visual Style"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ModelGraphicsStyle { get; }
Public Shared ReadOnly Property ModelGraphicsStyle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ModelGraphicsStyle {
	ForgeTypeId^ get ();
}
static member ModelGraphicsStyle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace